Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 说着直接扬起刚刚从易峰手里接过的剑，开始在鱼尾上片起了生鱼片。
en_us: She raised the sword she received from Yi Feng and began to slice the fish's tail into sashimi.

source: 说着转身一头扎进了树林，不到半会，只听见唰啦啦的一阵什么滑过的声音，四周的树木突然被从两边挤开。她一手拖着什么，一步步走了回来。
en_us: She turned around and ran into the forest. After a few seconds, they heard sounds of slashing coming from inside the forest. The trees began to bend outward, opening up a lane on which Shen Ying walked out. She was holding something in her hand.

source: 说着钱万贯的眉头蹙了起来，沉默了很久，才苦笑说道：“大哥，这事我可以帮你，短期内我能利用家族的人帮你掩护一下，但这事瞒不了多久。除非你在学院内不冒头，一旦你成为精英学员，各家族都会调查你的资料，到时候绝对有人会查出一丝蛛丝马迹的。”
en_us: Qian Wanguan's eyebrows furrowed as he spoke and only squeezed out a wry smile after a long silence, " Big Brother, I can help you on this matter and make use of the people in my family to hide your identity for the time being. However, it would only be a matter of time before word gets out. Unless you stay completely low-key in the Academy, else as soon as you become an elite student, every family would run a check on your background and it would only be a matter of time before others find traces of your identity."

source: 说着，他指了指右侧道，“之前吃饭的时候，我打听过了，上青城离此不远。我们穿过这片森林过去就到了。”
en_us: Lonemoon gestured to the right and said, ”I went to ask around during lunch earlier. Upper Azure Town isn’t far from here. We just have to go through this forest and we'll be there."

source: 说着，柳长老就大步朝旁边的一个偏厅内走去。江逸踌躇一阵只能咬牙上了，运转蓝色元力双手贴在丹炉侧壁上。
en_us: Finishing his scolding, Elder Liu walked with big steps in the direction of a side room. Jiang Yi hesitated for a moment, knowing that he had to grit his teeth and do this task, before sticking both his hands on the cauldron walls and applying blue essence force.

source: 说着，江松就眼露凶光，嘴里大喊“赤练黑砂掌”，双掌掌心呈现一片慑人的黑色，狠狠拍向江逸后背。
en_us: Right after speaking, Jiang Song revealed an ominous glint in his eyes as he shouted, "Red-Band Black Sand Palm!" Both his palms produced terrifying black discs, which he viciously unleashed on Jiang Yi's back.

source: 说着，法器已经带着众人飞了进去，入界瞬间，一道阵法光亮起，瞬间整个叶上的人都被包裹在里面，隔绝了四周的妖气。
en_us: As she explained, the Dharma artifact had already flown into the Demon Realm. The moment they entered the Demon Realm, an array formation lit up which encapsulated everyone on the leaf Dharma artifact, isolating them from the demonic aura of the surroundings.

source: 说着，管事也不再理会江逸，转头谄媚笑着和那马家公子低声说道：“飞少，时间还早，要不让小凤仙伺候下您？这小凤仙最近可是和花姐学了不少新活儿，保证您舒坦。”
en_us: Thereafter, he ignored Jiang Yi completely. Turning to the Ma Family young master, he asked with a toadying smile, "Young Master Fei, there's still plenty of time, why don't we summon Little Fengxian over to service you? She has learned many new tricks from Madam Flower recently, guaranteed to bring you great comfort."

source: 谁TM叫谁宝宝呢？虽然他的系统是育儿系统，但你还真把我当小孩是什么鬼？
en_us: Who the hell was she calling Baby? Although his was a parenting system, do you really have to treat me like a child?

source: 谁TM知道原来体修还有第二形态，一战斗就会暴出全身肌肉，秒变金钢芭比啊喂。
en_us: Who freaking knew that Body Cultivators had a second mode? Bursting into muscles in battle and immediately transforming into an iron barbie?

source: 谁也不知道他的名字，早年他的朋友们都叫他无名。
en_us: No one knew his name. In the early years, his friends used to call him Wu Ming, the nameless one.

source: 谁料，此刻姬听雨目光正朝他们这群陪练扫来，恰好和江逸对视了一眼，而等在江逸慌忙低头隐藏身形时，那姬小姐却突然伸出一根葱白手指指着江逸，淡淡开口道：“诸位公子好意，听雨心领了，杨管事，给我安排这戴狼首面具的陪练对战一场。”
en_us: Who knew that at the moment Ji Tingyu's gaze was sweeping across the room in the direction of the group of sparring partners, and she had coincidentally met Jiang Yi's eyes. As Jiang Yi hurriedly lowered his head to hide his body, that Young Mistress Ji suddenly extended an onion-white finger and pointed towards Jiang Yi. She faintly opened her mouth to say, "Everyone, this young gentleman has good intentions and I, Ji Tingyu, receive and appreciate your kindness. Manager Yang, please arrange for me to have a sparring match with the sparring partner wearing a wolf mask."

source: 谁是你的小东西！
en_us: Who's your little thing?!

source: 谁是小红？
en_us: Who's Little Hong?

source: 谁知江逸的身子一闪，竟在半路转向朝右边掠去，而右边的两人本看着江逸朝左边冲去，身体已经开始转向了，现江逸却笔直朝两人冲来？当下只能慌乱的挥舞拳头，朝江逸砸去。
en_us: Who knew that Jiang Yi's figure would duck out of the way and, in the midst of his run, turn to sweep towards the right? How could the two persons on the right predict that, having originally seen Jiang Yi rush towards the left and having started turning their bodies in the same direction, Jiang Yi would actually race straight towards them right now? The two persons could only brandish their fists in a state of confused fury and smash them towards Jiang Yi.

source: 谁知，异变突生——
en_us: He was unprepared for the unexpected change.

source: 谁要你的蒲公英!
en_us: Who wants your dandelions!

source: 谁都不知道他从哪冒出来的，出现时就是金丹修为。传闻他生性嫉恶如仇，好打抱不平。死在他手上的魔修不计其数。
en_us: No one knew where he came from, for when he appeared, he was already a Golden Core sword cultivator. Rumor had it that he hated evil with a vengeance and that he liked to champion the cause of justice. Countless fiendish cultivators had died by his hands.

source: 败家子*2！
en_us: Prodigal!

source: 费老漠然起身朝外面走去，在门口才侧脸解释了一句：“十五六岁的才铸鼎境二重，这小子已经过了修炼的黄金时段，这辈子不会有大成就了，尽管反应能力变态，但境界提升不上来，也只能是个废物，武殿……不养废物。”
en_us: Elder Fei apathetically stood up and walked in the direction of the exterior of the room. It was only when he reached the door that he turned his head around and explained, "He's fifteen or sixteen years old, yet his power level is only at the second stage of the Cast Tripod Realm. This boy's already missed the golden opportunity to cultivate his power and as such he'll not have any great accomplishments for the rest of his life. Even if he does have an obscenely powerful capability to react to opponents' moves, so long as he can't increase his power-level stages, he's just going to be a good-for-nothing. The Martial Arts Hall... does not waste resources on caring for useless good-for-nothings."

source: 赔我的学生！
en_us: Give me back my students!

source: 赤练黑砂掌！
en_us: Red-Band Black Sand Palm!

source: 走到半山，江如虎终于缓过来一口气，他艰难的开口道：“江逸……实力进步的那么快……不能……等我哥回来……我要他死……全部人给我记住，今日之事……就说和马家开战……”
en_us: Jiang Ruhu finally revived and took in a breath of air, they were mid-way down the mountain. With much difficulty, he opened his mouth and said, "Jiang Yi's... power has improved so quickly... cannot... wait for my brother to return... I want him dead... everyone better remember, whatever happened today... just say that we had to fight with the Ma Family..."

source: 走到半路，他脚步突然一顿，拐进了旁边一个衣袍铺子内，很快就穿着一身黑袍走了出来，还把脑袋全部笼罩在斗篷内。
en_us: Along the way, he suddenly froze in his tracks and turned into a nearby garment shop. It was not long before he came out dressed in black from head to toe, and even had his head enveloped in a cloak.

source: 走哪？刚刚到底发生了什么？她们是谁？她们在哪？
en_us: Go where? What had just happened? Who were they? Where were they?

source: 走完最后一阶的瞬间，眼前景色一换，与一二层那样宽广的地界不同，这里似乎是座殿宇内，四周还燃着灵火，他脚下还有着传送阵法的光芒，而殿中高台上坐着五个人。
en_us: As he ascended the final step, the view in front of him changes. The vast spaces he saw in the first and second levels was now replaced with a confined space - the inside of what looked like a temple hall. Spirit fires surrounded him and a transportation array lay under his feet. Five people were seated atop a stage in the middle of the hall.

source: 走廊上走来四人，全部衣袍华贵，气态不凡，是三名公子和一名漂亮小姐。小姐一身黄裳长裙，靓丽如一朵盛开的黄玫瑰，正是姬家小姐姬听雨，而旁边的三位公子中江恨水赫然在列。
en_us: Four people walked through the corridor, all of them dressed elegently in luxurious clothes with extraordinary atmospheres about them. They consisted of three gentlemen and a beautiful lady. The young lady was dressed in a yellow robe with long dress and was pretty like a yellow rose in full bloom. That was the young mistress of the Ji Family Ji Tingyu, and amongst the three gentlemen beside her included, impressively enough, Jiang Henshui.

source: 走进武殿，江逸明显感觉一丝不对了，这里的气息比外面清新好闻多了，他不用闭关打坐都知道这里的天地灵气浓郁得吓人，在这里面修炼速度绝对比外面快很多。
en_us: Entering the Martial Arts Hall, Jiang Yi evidently felt that something was not right. The atmosphere in the building was a lot more fresh, clean and nicer-smelling than the air outside. He didn't need to go into seclusion and sit in meditation to know that the heavenly and earthly spiritual forces in here were obscenely powerful, allowing anyone's cultivation speed to be much faster in the Hall than outside.

source: 越想就越气，深呼吸几次，才压下心底的怨气开口，“喂，我找你有事，你先跟我来一下，我们聊聊。”
en_us: The more he brooded over it, the more anger he felt. He took several deep breaths before holding back the resentment and said, "Hey, I was looking for you to discuss a matter. Follow me and let's talk about it."

source: 越来越不懂这些兽兽们的世界了。
en_us: He was getting more and more confused by the world of beasts.

source: 足足半柱香时间，江逸才平静下来，他擦拭了眼角的泪痕，长长吐出两口气他又入定了，仔细的内视丹田外的封印，确定那龙形封印上的符文的确少了三枚后，他彻底放松下来。
en_us: It took him half the time it takes for a stick of incense to burn before Jiang Yi finally calmed himself down. He wiped off the tear stains from the corners of his eyes, took two long deep breaths, and returned to a meditative state. He carefully observed the seal outside his dantian. It was only after confirming that the runic patterns of that dragon-shaped seal had indeed been reduced by three characters that he completely relaxed.

source: 足足盘坐了一个时辰，江逸才睁开了眼睛，眸子内都是无奈，他刚才运转江水决疗伤的时候内视了一下，发现左肩的三根骨头果然有几处裂痕，靠江水决疗伤速度最少要打坐一天一夜才能愈合。
en_us: After sitting cross-legged for two entire hours, Jiang Yi finally opened his eyes with a look of helplessness. When he was just circulating the Jiang Water Art, he had used his inner vision and discovered that three bones on his left shoulder had cracked. This was an injury which, relying on the Jiang Water Art, would take at least a full day and night of meditation to fully heal.

source: 足足花了半个月的时间，她才恢复过来，并稳定了境界。就连其它人的修为，也纷纷增长了，虽然没有像思羽一样直接结丹，但最少的也涨了一个小境界，体修已经成了不可改变的事实。
en_us: After exactly half a month's time, she finally recovered and her cultivation stabilized. Even the rest of them had grown in their cultivation. Although they were unlike Si Yu who had directly completed her Core Formation, they were at least improving by a minor realm. Their cultivation of the body had already become a fact that could not be changed.

source: 距离和风月楼约定的一月之期只有十八天了，江逸此刻身上只有十两银子，他想了很多办法，但最后发现除了和江家坦白，让江家出钱外，他唯有找姬听雨借钱了。
en_us: There were only eighteen days left to go before the one-month deadline on the agreement of repayment made with the Fengyue Brothel was up, yet at the moment Jiang Yi only had ten taels of silver on his person. He tried to come up with many ideas, but eventually realised that, besides coming clean with the Jiang Clan and letting the Family come up with the money, he had no other viable option but to seek Ji Tingyu and borrow money from her.

source: 跟下界传闻的一样，上青界最大的修仙势力不是宗门，而是四大世家。除了以丹修闹名的轩辕家外，还有以符阵闻名的郁家，御兽练器为主的易家，以及最有钱的印家。印家掌控着半数以上灵石矿，上青城半数以上的商店都是印家的，包括之前吃霸王餐的那一家。
en_us: It was the same story up here as it was in the Lower Realm—the most powerful immortal cultivators were not in the sects but in the four aristocratic families. There were three others apart from the pill-refining Xuan Yuan Family: The Yu Family who was famous for their talisman arrays, the Yi Family who specialized in beast control and weapon refinement, and the Yin Family who was filthy rich. The Yin Family controlled more than half of the Spirit Stone mines and more than half of the shops in Upper Azure Town including the restaurant where they were accused of eating a free meal.

source: 跳进来！莫非是直接从外面冲进来的？这怎么可能！世间居然有人可以破开他的升仙塔！
en_us: Jumped in here! Did she come in straight from the outside? How's that possible! How is there someone on this earth who could break through his Immortal Ascension Pagoda!

source: 身后就是小奴，江逸为了不让护卫们冲进来，动用了压箱子的人阶上品武技，这是他唯一在江家学会的一种比较高级武技。
en_us: Not wanting to let the guards in with Xiaonu behind him, Jiang Yi used his best Man-tier superior-grade martial arts technique. This was the only high-class skill he had learned in the Jiang Clan.

source: 身后站起来的江小奴瘦弱身子剧烈颤抖起来，紧紧抓住江逸的手臂，眼中泪水不要钱的倾泻而出，她咬牙低声说道：“少爷，都是小奴不好，你快走吧，别管小奴了。“
en_us: Jiang Xiaonu stood up behind him, her frail weak body trembling violently as she held tightly onto Jiang Yi's arm. Free-flowing tears gushed out of her eyes. She clenched her teeth and pleaded in a low voice, "Young Master, it's all my fault. You can just leave; don't worry about me anymore."

source: 身形一闪下一刻已经站到了对方的面前。
en_us: In the blink of an eye, she had moved next to Zhen Xiang.

source: 身有仙骨才能算是正宗地仙，看来他得想点别的办法了。当然现在最重要的是，把男主这个事搞定先，无论如何都不要跟主角扯上关系，特别是羿清。
en_us: Immortal bones was the prerequisite to be even considered as an immortal. Seems like he had to look for other ways. What was most important was to settle the matter of the male protagonist. They must stay away from the main characters, especially Yi Qing, at all costs.

source: 轩辕家主派出十几位化神修士，竟无一是其对手，全部败于剑下。而且当时正巧族中几位游仙长老外出未归，轩辕家损失惨重，就连家主都受了重伤。
en_us: The Xuan Yuan Family had sent more than ten people at the Soul Formation stage to fight against them, yet not one of them could defeat the sword cultivators. The few Traveling Immortal Elders who were sent out earlier had also failed to return home. The Xuan Yuan Family suffered great losses — even their master was heavily injured.

source: 轩辕家主：“……”
en_us: Xuan Yuan Family's master: "..."

source: 轩辕家主：“……”他家的游仙，是不是被打傻了？
en_us: Xuan Yuan Family's Master: "..." Were the Traveling Immortals from his family concussed?

source: 轩辕心底一个咯噔，完了！
en_us: Xuan Yuanyu's heart skipped a beat, that's it!

source: 轩辕禹一抖，立马站直了身子正义言词的道，“有的大仙！大仙，您要长刀，短刀，朴刀，大环刀，还是斩马刀？”说完扬手一挥，顿时十几把各式各样的刀具，就浮在了她旁边。
en_us: Xuan Yuanyu felt a shiver down his spine. He immediately straightened up and said in a righteous tone, "Yes I have one, Great Immortal! Do you want a long knife, a short knife, a Pudao [1. Like this https://en.wikipedia.org/wiki/Podao], a scimitar, or a Steed Slaying Saber?" With a wave of his hand, different types of knives appeared which floated around her.

source: 轩辕禹愣了一下，“的确有事……”
en_us: Xuan Yuanyu hesitated before he began, "Well, I was…"

source: 轩辕禹抖了抖，想起了某些画面，突然不想问上青城到底发生什么了？
en_us: Xuan Yuanyu shivered, recalling certain images and suddenly did not want to ask what happened in the Upper Azure Town anymore?

source: 轩辕禹摸了摸自己的小心脏，就现在这个情况来说，突然就有点庆幸，当日大仙来轩辕家时，是真的想找他聊聊，压根没有认真动手的意思。
en_us: Xuan Yuanyu patted his chest to calm his pounding heart. Looking at this sorry state of affairs, he suddenly felt thankful. When the Great Immortal had come to the Xuan Yuan family the other time, she must have meant it when she had spoken of wanting to discuss something with him; she truly did not have any serious intention of resorting to violence.

source: 轩辕禹深吸了一口气，咬了咬牙道，“羿清尊者，我们明白你的意思。若真是不能……我等三家只记救命恩情，不论生死。”能唤醒自然是好，但若真的已经被心魔侵蚀，失去了自我，就算出了这升仙塔，以后也是个只知杀戮的魔物而已。
en_us: Xuan Yuanyu took a deep breath and gritting his teeth, said, "Yi Qing Supremacy, I understand what you mean. If there's no way... our three families will aways be grateful to you for saving us, no matter what the outcome." It would be good if their men could wake up, but if their self-identities were eroded by the mental demons, even if they left the pagoda, they would only become useless killing machines.

source: 轩辕禹点了点，连忙转身引路道，“既然如此，比赛马上要开始了，可否请大仙上坐一同观赛。”
en_us: Xuan Yuanyu nodded and quickly turned to lead the way. "In that case, since the competition is about to start, would Great Immortal please sit with with us to watch the competition?"

source: 轩辕禹立马掏出一个巴掌大的小瓶子递给了孤月，又加了一句道，“她们擅未结婴，修补根基宜早不宜晚。”
en_us: Xuan Yuanyu immediately took out a palm-sized bottle and handed it over to Lonemoon. He added, "They have not completed their Nascent Soul Formation yet, so repairing their foundation as soon as possible will be beneficial."

source: 轩辕禹都呆住了，大仙怎么自己承认了！？这是要正面开撕的节奏吗？
en_us: Xuan Yuanyu was stunned, how could the Great Immortal admit it?! Was this the prequel of a direct battle?

source: 轩辕禹顿时抖了一下，还好事先说好了。
en_us: Xuan Yuanyu trembled. Fortunately, he spoke to her before they entered.

source: 轩辕禹：“……”
en_us: Xuan Yuanyu: "…"

source: 轩辕禹：“……”突然不想要了是肿么回事？
en_us: Xuan Yuanyu: "…" I suddenly don't feel like receiving them anymore?

source: 转了一个上午，江逸垂头丧气的坐在广场中心一个石墩上，他根本不懂怎么赚钱，除非给人去做苦力，但一天只有几个铜板，杯水车薪啊。
en_us: After wandering around for an entire morning, Jiang Yi sat down dejectedly on a stone block in the middle of the City Plaza. He had no idea how to make money at all, unless he got employment as a coolie - which was a job with a meagre income of a few bronze coins, an utterly inadequete amount of earnings.

source: 转头一看厅里坐了好几个人，上首的正是郁海珩，下方还坐了五位年纪不同的修士，居然全是郁家游仙。
en_us: He turned around and saw that there were several people seated in the room. Their leader was Yu Hai Heng, who brought with him five cultivators of different ages. All of them were Traveling Immortals from the Yu Family.

source: 转头看了旁边懒洋洋的沈萤一眼咬了咬牙。真是见鬼了！他是真没想到，系统居然会突然出这样的问题，出不了气不说，还尽发些莫名其妙的任务，害他把修行几百年的脸，全丢光了。
en_us: He glanced at the overjoyed Shen Ying who was standing beside him and gritted his teeth. Just his luck! He didn't think that the system would cause him these problems. Now, not only did he fail to take revenge for his brothers, the system's strange missions made him lose the reputation that he had built up over hundreds of years.

source: 转头看了看那个已经停手，独自站在中间的某人，他抖了抖，列祖列宗保佑啊。
en_us: Turning around, Xuan Yuanyu looked at a lone figure standing in the middle of it all who had stopped her bashing. He shivered a little, praying for the blessings of his ancestors.

source: 转悠一圈，他猛然想起什么，一拍脑袋懊恼说道：“我炼个屁的丹啊，我都不会炼丹……”
en_us: After wandering around the room once, he suddenly thought of something. He slapped his forehead and exclaimed, "What I am thinking? Refining elixirs? I don't even know how to refine elixirs..."

source: 转手把少了一半海鲜的袋子递给了白泽，“不好意思，忘了分脏。给！”
en_us: She passed the bag with half its original contents to Bai Zhe and said, "Sorry, I forgot to divide the spoils."

source: 转眼却看到了对方手里拿着一把扇形武器很是眼熟，“我的本命法器！”为什么会在魔修手上！
en_us: The next moment, he realized the other party had a familiar-looking fan-like weapon in her hand. "That's my intrinsic dharmic artifact!" Why was it in the hands of a fiendish cultivator!?

source: 轰隆一声响，身上新生仙骨顶住了最后一道劫雷。他成功了！
en_us: Boom! His body, regenerated with the newly created Immortal Bones, withstood the last bolt. He had succeeded!

source: 轰隆一声，不止是阵法，连着四周也一阵剧烈摇晃起来。地上哗啦一下，直接被踩出了一条条手臂宽的长沟。直接把阵法给撒裂了，白光顿时全暗。
en_us: With a great rumbling noise, not only the array, but also the surroundings shook tremendously. The ground immediately split apart creating long fissures the width of an arm’s length. The array had been completely destroyed, and the white glow it was giving off faded.

source: 轻松在里面转了几圈，翊飞儿整整攻击了半柱香时间，连江逸的一片衣角都没有碰到。
en_us: Jiang Yi was effortlessly moving in circles. Yi Fei-er threw her attacks at him for close to three minutes, yet she was unable to even brush against his garments.

source: 轻轻一甩，嘭的一声，一根漆黑如墨的巨大条壮物就被甩到了易峰面前。
en_us: She gave it a shake and threw a black, strong beast onto the floor in front of Yi Feng.

source: 辛苦个屁啊，狐妖呢，狐妖呢？说好的逼它出来呢！压根还没有出来好吗！
en_us: Good job my foot! Where's the fox demon? You said you would force it out! It hasn't bloody come out yet!

source: 辣鸡沈萤，毁我仙途，阻我飞升！
en_us: Rotten Shen Ying. She destroyed my immortal future and prevented me from achieving Immortal Ascension!

source: 达到铸鼎境的人都能内视自己的身体，江逸默默注视着那丝神秘的元力，它就仿佛一根一寸长的发丝，安静的呆在自己的丹田之内，越看越让他觉得可爱。
en_us: Those who had attained the Cast Tripod Realm could look within their bodies. Jiang Yi fixed his eyes on the mysterious strand of essence force. It was like an inch-long hair strand that sat quietly within his dantian. The more he looked at it, the more adorable he found it.

source: 过来人轩辕禹：“……”
en_us: Xuan Yuanyu, who had previous experience in such matters: "…"

source: 近看那座升仙塔感觉更大了，表面更是时不时的滑过一缕缕仙气。塔边汇聚了不少的修士，修为有高有低。塔门是敞开的，并没有人把守，但在场的修士大多都只是观望，到很少有人进去。
en_us: Close up, the Immortal Ascension Pagoda looked even bigger, with immortal Qi constantly swirling around it. A number of cultivators of various cultivation levels were gathered around its base. No one guarding the pagoda gate, which was open. But hardly any of the cultivators went in, most were just curious onlookers.

source: 还……还……还在睡，话说她到底是怎么一路走到这里啊喂！
en_us: Still… Still… Still asleep, how exactly did she walk all the way till here!

source: 还不如不开呢！
en_us: I'd rather it not be opened!

source: 还刚巧遇到了门口的印风和轩辕禹。
en_us: At the door, she bumped into Yin Feng and Xuan Yuanyu.

source: 还剩两丝黑色元力，江逸胡乱的运转其中一丝和蓝色元力融合之后在身体内四处游走着，心里是一种暴发户感叹没地方花钱的心态。
en_us: Having two slivers of essence force left, Jiang Yi randomly circulated one wisp to the blue essence force. He allowed it to flow randomly within his body. He felt like a nouveau riche sighing over not having a place to spend his money.

source: 还好，风月楼和江家大院同在东城，江逸只是花费了半柱香时间就抵达风月楼所在的东云街上，他目光如电锁定一栋气派恢弘的阁楼，身子再次狂奔而去。
en_us: Luckily, Fengyue Brothel was in the eastern part of the city, just like the Jiang Clan’s courtyard. Jiang Yi only spent about three minutes to reach East Cloud Street where Fengyue Brothel stood. His eyes quickly fixed on a grand pavilion as he dashed forward once again.

source: 还有两道，他拼命保持着清醒，继续硬抗了接下来的一道劫雷。劫雷顿时停滞了三息，云层开始涌动起来。一道浓紫近黑的闪电终于出现在云层间，终于轰隆一声，带着毁天灭地的气势直劈而来。
en_us: There were two more. Lonemoon tried desperately to stay conscious as he was struck by the next the bolt of lightning. Then, all of a sudden, the Lightning Tribulation ceased and clouds began started to swirl. A purplish black lightning flashed throught the clouds. Finally there was a loud boom and an earth-shattering bolt struck down from the sky.

source: 还有，妖界什么时候出了个万妖王，普通妖王都是十阶，相当于元婴期，万妖王却是十二阶，等同于化神期。
en_us: Also, when did the demon world come to have a Myriad Demon King? The ordinary demon monarch's cultivation was at the tenth-level, equivalent to the Nascent Soul stage, but the Myriad Demon King was at the twelfth-level, equivalent to the Soul Formation stage.

source: 还有，灵主刚刚被踹前，想说的话不会是……不打算回去了吧？！
en_us: And before Spirit Master was kicked throuogh the realm gate, was he about to say that he did not want to go home anymore?

source: 还未想通，却见她突然叹了一口气，抖了抖另一只手上正偷偷用叶子卷她手腕的萝卜。
en_us: Before he could figure it out, he heard Shen Ying sigh. She lifted up her other hand. Hanging from it by the leaves was the radish.

source: 还未等他想清，却见那女子一脸随意道，“那啥说……你交给我。”给过钱的那种，“所以麻烦你配合一下。”
en_us: Before he could gather his thoughts, he saw the woman break into a smile as she said, “The person over there said… I'm to handle you. He has paid me, so I'll appreciate it if you cooperate."

source: 还没冲过来，江逸就沉吼起来：“小奴怎么了？春芽，你说我家小奴怎么了？”
en_us: He shouted out even before dashing over, "What happened to Xiaonu? Chunya, what did you say happened to Xiaonu?"

source: 还没想清，却见她直接从半人深的坑里爬了出来，转手递了一样东西到他嘴边，很是随意的说了一句，“饿不饿，吃吗？”
en_us: Before he could think further on it, he saw that she had climbed directly out of the pit which was waist deep. She had something in her hand, which she brought to his mouth. In a casual tone she asked him, "Are you hungry? Do you want to eat?"

source: 还没靠近，风月楼外的两名龟公的拉客声就隐隐传来，此刻已经是近黄昏时分，风月楼开张了。
en_us: Despite being a distance away from Fengyue Brothel, he could hear the the pimps outside Fengyue Brothel hustling customers. It was nearing dusk—the time when Fengyue Brothel opened for business.

source: 还真是！
en_us: It's really true!

source: 还真有啊喂！要不要这么效率？！
en_us: There really is such a place! Do you have to be so efficient?!

source: 还能不能玩了？！
en_us: Could the game even continue?!

source: 还要不要点脸?!
en_us: Do you all have any sense of shame?

source: 这TM……哪里是剑仙啊？！
en_us: How on earth is this a sword immortal?!

source: 这TM是在玩他吧？感觉老天爷已经越来越不爱他了。
en_us: He was being freaking toyed with, right? He felt like the heavens had begun to lose their love for him.

source: 这……怎么可能？！
en_us: How... could this be?!

source: 这……能吃吗？
en_us: "Can this.. be eaten?"

source: 这……这人什么时候在这里的？刚刚不是只有他跟道君两个人上路的吗？什么时候多出了一个人？
en_us: When… when was this person here? Wasn’t it just him and Dao Lord on the journey? When was there one more person?
